#!/bin/bash
sed -e 's/искуственн/искусственн/g' |
sed -e 's/росийск/российск/gI' |
sed -e 's/\bзаместо\b/ вместо /gI' |
sed -E 's/(В|в)\s+(течении)\s+(([а-я0-9\-]+\s+){0,2})\s+(осени|зимы|весны|лета|года|лет|час[а-я]+|дня|дней|минут|[а-я]*секунд|век[а-я]+|недел[а-я]?|месяц[а-я]+|столети[яй]+|десятилети[яй]|тысячелети[яй]+|декад|времени|период[аов]+|заняти[йя]+|урок[ова]+|курс[ова]+|эксперимент[аов]+)/\1 течение |3 |5/g' |
sed -e 's/\bмороженное/ мороженое/gI' |
sed -e 's/\bедь/ езжай/gI' |
sed -e 's/\bвобщем/ в общем/gI' |
sed -e 's/\bвобще/ вообще/gI' |
sed -e 's/\bвообщем/ в общем/gI' |
sed -e 's/\bдевченк/ девчонк/gI' |
sed -e 's/\bучавствова/ участвова/gI' |
sed -e 's/\bподскользнул/ поскользнул/gI' |
sed -e 's/\bнадсмехал/ насмехал/gI' |
sed -e 's/\bихн(ий|ие|их|яя|ея|ии|ее)\b/ их /gI' |
sed -e 's/\bприйдти\b/ прийти /gI' |
sed -e 's/\bпридти\b/ прийти /gI' |
sed -e 's/\bприйду/ приду/gI' |
sed -e 's/\bзайм\b/ заём /gI' |
sed -e 's/\bв аэропорте\b/ в аэропорту /gI' |
sed -e 's/\bчерезчур\b/ чересчур /gI' |
sed -e 's/\bкоординальн/ кардинальн/gI' |
sed -e 's/\bэкспрессо\b/ эспрессо /gI' |
sed -e 's/\bобажа/ обожа/gI' |
sed -e 's/\bпопробыва/ попробова/gI' |
sed -e 's/\bэкстримальн/ экстремальн/gI' |
sed -e 's/\bсимпотичн/ симпатичн/gI' |
sed -e 's/\bбудующ/ будущ/gI' |
sed -e 's/\bтайланд/ таиланд/gI' |
sed -e 's/\bпроблемм/ проблем/gI' |
sed -e 's/\bздела/ сдела/gI' |
sed -e 's/\bсабак/ собак/gI' |
sed -e 's/\bрасчит/ рассчит/gI' |
sed -e 's/отвеств/ответcтв/gI' |
sed -e 's/ответсв/ответcтв/gI' |
sed -e 's/проффес/професс/gI' |
sed -e 's/преподоват/преподават/gI' |
sed -e 's/компетенност/компетентност/gI' |
sed -e 's/\bоссийск/ российск/gI' |
sed -e 's/\bедераци/ федераци/gI' |
sed -e 's/компитен/компетен/gI' |
sed -e 's/метамати/математи/gI' |
sed -e 's/матимати/математи/gI' |
sed -e 's/\bюгозапад/ юго-запад/gI' |
sed -e 's/\bсеверозапад/ северо-запад/gI' |
sed -e 's/\bунтерофицер/ унтер-офицер/gI' |
sed -e 's/\bсеверовосто/ северо-восто/gI' |
sed -e 's/\bюговосто/ юго-восто/gI' |
sed -E 's/(\bпрограм)(а|у|ой|ы|е|ист|ир)/ программ\2/gI' 
sed -e 's/\byt\b/ /gI' |
sed -e 's/\byb\b/ /gI' |
sed -e 's/\byj\b/ /gI' |
sed -e 's/\byf\b/ /gI' |
sed -e 's/\bgj\b/ /gI' |
sed -e 's/\bjn\b/ /gI' |
sed -e 's/\bpf\b/ /gI' |
sed -e 's/\bnfr\b/ /gI' |
sed -e "s/\b'nj\b/ /gI"

