#!/bin/bash
sed -e 's/искуственн/искусственн/g' |
sed -e 's/росийск/российск/gI' |
sed -e 's/\bзаместо/ вместо/gI' |
sed -E 's/(В|в)\s+(течении)\s+(([а-я0-9\-]+\s+){0,2})\s+(года|лет|час[а-я]+|дня|дней|минут|[а-я]*секунд|век[а-я]+|недел[а-я]?|месяц[а-я]+|столети[яй]+|тысячелети[яй]+|декад|времени|период[аов]+|заняти[йя]+|урок[ова]+|курс[ова]+|эксперимент[аов]+)/\1 течение \3 \5/g' |
sed -e 's/\bмороженное/ мороженое/gI' |
sed -e 's/\bедь/ езжай/gI' |
sed -e 's/\bвобщем/ в общем/gI' |
sed -e 's/\bвобще/ вообще/gI' |
sed -e 's/\bвообщем/ в общем/gI' |
sed -e 's/\bдевченк/ девчонк/gI' |
sed -e 's/\bучавствова/ участвова/gI' |
sed -e 's/\bздела/ сдела/gI'